Revit 2027 API
BuiltInFailures.StairRampFailures.RampDoesntReachOffset Property
 The ramp is not long enough to reach the top constraint plus top offset. Change the slope or increase the length of the ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RampDoesntReachOffset { get; }
Public Shared ReadOnly Property RampDoesntReachOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RampDoesntReachOffset {
	FailureDefinitionId^ get ();
}
static member RampDoesntReachOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace